w08_d3_to_do_list_AJAX/app/controllers/emails_controller.rb

SELECT "emails".* FROM "emails" ORDER BY "emails"."created_at" ASC
---
  def index
    @emails = Email.all