w08_d3_to_do_list_AJAX/app/controllers/tasks_controller.rb

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2020-05-28 15:54:25.282192"], ["id", 93]]