w08_d3_to_do_list_AJAX/app/views/tasks/create.js.erb

INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-05-28 14:34:32.291928"], ["updated_at", "2020-05-28 14:34:32.291928"], ["title", "Essai"], ["deadline", "2020-05-29 00:00:00"], ["category_id", 6]]
---
document.querySelector("#<%= @task.category.title.split(" ").join("") %> + .card ul").insertAdjacentHTML("beforeend", "<%= j render 'task', task: @task %>")