w08_d3_to_do_list_AJAX/app/views/tasks/destroy.js.erb

$('.delete-task').bind('ajax:success', function() {
  $(this).closest('li').fadeOut();
});
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]