w08_d3_to_do_list_AJAX/app/views/tasks/update.js.erb

document.querySelector("#task-<%=@task.id%> span.task-title").classList.toggle('task-status-true');
---
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", true], ["updated_at", "2020-05-28 16:08:49.585031"], ["id", 84]]